Repository: OpenChain-Project/Reference-Material
Catalog: Training-Slides/Official/1.0/ko/Translation-Tools/Curriculum-Translation-KR-level2.tmx
Source language: en_us
Languages: ko

source: It is a “term of art” meaning that it has a particular meaning based on the statute and not the dictionary definition
ko: 사전 정의가 아닌 법령에 근거한 특별한 의미를 갖는 "전문 용어"이다.

source: It is intended to provide context for the “big picture” and to establish that today we are only discussing copyright and patents, the areas most relevant to FOSS compliance.
ko: "큰 그림"에 대한 배경을 제공하고 오늘날 우리가 저작권 및 특허, 즉, FOSS 준수와 가장 관련이있는 영역에 대해서만 논의하고 있음ㄴ을 나타내기 위한 것입니다.

source: It should be interactive to ensure all those groups correctly understand the issues and can create clear, shared guidance.
ko: 모든 그룹이 문제를 정확히 이해하고 명확하고 공유된 가이드를 만들 수 있도록 상호 작용해야 한다.

source: It should be noted that this list of information looks quite large.
ko: 이 정보 목록은 상당히 커 보인다는 점에 유의해야합니다.

source: JavaScript, web client, or other code that is downloaded to the user’s machine
ko: 사용자의 기계에 다운로드된 자바스크립트, 웹 클라이언트 또는 다른 코드

source: Kernel Space
ko: 커널 영역

source: Key Software Concepts for FOSS Review
ko: FOSS 검토를 위한 소프트웨어 핵심 개념

source: Know your obligations.
ko: 귀하의 의무 파악.

source: Large entities tend to require more information than small entities.
ko: 대기업은 작은 기업보다 더 많은 정보를 요구하는 경향이 있습니다.

source: Learn more at: https:// www.openchainproject.org
ko: 자세한 내용 참조: https:// www.openchainproject.org

source: Learn more at: https://www.openchainproject.org
ko: 자세한 내용 참조: https://www.openchainproject.org

source: Learn more through the free Compliance Basics for Developers hosted by the Linux Foundation at: https://training.linuxfoundation.org/linux-courses/open-source-compliance-courses/ compliance-basics-for-developers
ko: Linux Foundation에서 주최하는 무료 교육(Compliance Basics for Developers)에 대해 자세히 알아보십시오: https://training.linuxfoundation.org/linux-courses/open-source-compliance-courses/ compliance-basics-for-developers

source: Legal
ko: 법무팀

source: Legal teams analyze and determine license obligations and provide guidance
ko: 법률 팀은 라이선스 의무를 분석 및 결정하고 가이드를 제공합니다.

source: Legal to identify and evaluate license obligations
ko: 라이선스 의무를 확인하고 평가하는 법무팀

source: Legend
ko: 범례

source: License Compatibility
ko: 라이선스 양립가능성

source: License Compliance Pitfalls
ko: 라이선스 컴플라이언스 함정

source: License Compliance pitfalls
ko: 라이선스 컴플라이언스 함정

source: License Reciprocity & Copyleft Licenses
ko: 라이선스 상호주의(성) 및 Copyleft 라이선스

source: License and License URL
ko: 라이선스 및 라이선스 URL

source: License compatibility is the process of ensuring that license terms do not conflict.
ko: 라이선스 양립가능성은 라이선스 조건들이 서로 충돌하지 않도록 하는 절차이다.

source: License notice – a notice that specifies and acknowledges the license terms and conditions of the FOSS included in the product.
ko: 라이선스 고지 – 제품에 포함되는 FOSS의 라이선스 조건을 특정하고 인정하는 고지.

source: License reciprocity means that the derivative work of the copyrighted work must be made available under the same license.
ko: 라이선스 상호주의는 저작권으로 보호되는 저작물의 2차적 저작물은 동일한 라이선스로 사용할 수 있어야 함을 의미합니다.

source: Licenses
ko: 라이선스

source: Licenses that include reciprocity or Copyleft clauses include all versions of the GPL, LGPL, AGPL, MPL and CDDL
ko: 상호주의 또는 Copyleft 조항을 포함하는 라이선스에는 GPL, LGPL, AGPL, MPL 및 CDDL의 모든 버전이 포함된다.

source: Licensing modifications under the same license that governs the FOSS component
ko: 수정물에 FOSS 컴포넌트에 적용하는 라이선스와 동일한 라이선스를 적용한다.

source: Likewise, the engineering team may need assistance in implementing guidance from the FOSS review team.
ko: 마찬가지로, 엔지니어링팀은 FOSS 리뷰팀의 가이드를 이행하는데 도움이 필요할 수 있습니다.

source: Limited monopoly to incentivize innovation
ko: 혁신에 보상을 주기 위한 제한된 독점

source: Linking
ko: 링킹

source: Linking is when you link or join a FOSS component with your software product.
ko: 링킹은 소프트웨어 제품과 FOSS 컴포넌트를 링크하거나 연결하는 것입니다.

source: List and describe important business practices of a FOSS Compliance Program.
ko: FOSS 컴플라이언스 프로그램의 중요한 비즈니스 실무를 열거하고 설명하시오.

source: List of dependencies
ko: Dependency 목록

source: Location where the source code will be maintained
ko: 소스 코드가 유지될 위치

source: Manual recognition of new components added to the repository
ko: 저장소에 추가된 새로운 컴포넌트에 대한 수동 인식

source: Many companies use both an automated tool and manual review
ko: 많은 회사들은 자동화된 도구와 수동 검토를 모두 이용한다.

source: May also include contractual terms regarding warranties, indemnification, support, upgrade, maintenance
ko: 보증, 배상, 지원, 업그레이드, 유지 보수와 관련된 계약 조건도 포함될 수 있다.

source: Merging
ko: 병합 (Merging)

source: Modification
ko: 수정

source: Modification is when you make changes to a FOSS component.
ko: 수정은 FOSS 컴포넌트를 변경하는 것입니다.

source: Modification notice – a notice that you have made modifications to the source code of a file, such as adding your copyright notice to the top of the file.
ko: 수정 고지 – 파일의 제일 윗부분에 귀하의 저작권 고지를 추가하는 것과 같은, 파일의 소스 코드를 수정하였다는 고지.

source: Modify the material
ko: 자료 수정

source: More effective use of FOSS within your organization
ko: 조직 내 FOSS의 보다 효과적인 사용

source: Most companies are very leery of Shareware, because Shareware vendors often approach companies for large license payments after the software has freely propagated within their organizations.
ko: 쉐어웨어 공급 업체는 소프트웨어가 조직 내에서 자유롭게 전파 된 후 대규모 라이선스료 지급을 받기 위해 회사에 접근하기 때문에 대부분의 회사는 쉐어웨어를 매우 경계한다.

source: Most important copyright concepts for software are: right to reproduce, right to make creative works (or right to modify), and right to distribute.
ko: 소프트웨어의 가장 중요한 저작권 개념은 복제할 권리, 창의적 저작물을 만들 권리 (또는 수정할 권리) 및 배포할 권리가 있습니다.

source: Mozilla tri-license
ko: 모질라 트라이 라이선스 (Tri-license)

source: Multi-Licensing
ko: 다중-라이선싱

source: Multi-license refers to the practice where software is made available under multiple licenses.
ko: 다중 라이선스란 여러 라이선스 하에 소프트웨어를 사용할 수 있는 행위를 말합니다.

source: Multi-licensing refers to the practice of distributing software under two or more different sets of terms and conditions simultaneously
ko: 다중-라이선싱은 동시에 두 개 이상의 서로 다른 조건으로 소프트웨어를 배포하는 관행을 지칭한다.

source: Name some copyleft-style licenses.
ko: Copyleft 스타일의 라이선스를 거명하시오.

source: Name some general guidelines developers can practice when working with FOSS.
ko: 개발자가 FOSS로 작업할 때 실행해야할 몇가지 일반적인 가이드라인을 나열하시오.

source: Name some important steps in a compliance process.
ko: 컴플라이언스 프로세스의 중요한 단계를 나열하시오.

source: Name some permissive FOSS licenses.
ko: Permissive FOSS 라이선스를 거명하시오.

source: No – existing license information should be preserved, additional header information can be added for modifications or additions to source code (note, some licenses require documenting changes) .
ko: 아니오. 기존 라이선스 정보는 보존되어야 합니다. 소스 코드를 수정하거나 추가한 부분에 대한 추가 헤더 정보는 추가할 수 있습니다. (일부 라이선스에는 수정 내용을 문서화하는 것을 요구합니다.)

source: Not the functionality (that’s protected by patents) but the expression (creativity in implementation details)
ko: 기능(특허로 보호됨)이 아니라 표현(구현된 세부 사항의 창의성)이 보호를 받는다.

source: Note that this section provides a detailed example of what may take place in a large enterprise.
ko: 이 섹션에서는 대기업에서 발생할 수 있는 일에 대한 세부 예를 제공합니다.

source: Note: The interpretation of what constitutes a “derivative work” or a “distribution” is subject to debate in the FOSS community and within FOSS legal circles
ko: 참고 : "파생 저작물"또는 "배포"를 구성하는 내용에 대한 해석은 FOSS 커뮤니티 및 FOSS 법률 집단 내에서 토론의 대상이 된다.

source: Note: The process often starts when new FOSS-based software is selected by engineering or outside vendors.
ko: 참고: 프로세스는 주로 엔지니어 또는 외부 공급 업체가 새로운 FOSS 기반 소프트웨어를 선택한 때 시작된다.

source: Note: The process often starts when new FOSS-based software is selected by engineering or outside vendors .
ko: 참고: 프로세스는 주로 엔지니어 또는 외부 공급 업체가 새로운 FOSS 기반 소프트웨어를 선택한 때 시작된다. .

source: Note: This should not be confused for situations in which a licensor imposes more than one license, and you must comply with all of them
ko: 주의: 라이선서가 하나 이상의 라이선스를 부과하고, 귀하는 복수의 모든 라이선스를 준수해야 하는 상황과 혼동되어서는 안된다.

source: Notices
ko: 고지

source: Notices & Attributions
ko: 고지 & 출처에 관한 고지

source: Notices - Prepare notices as required by FOSS licenses.
ko: 고지 - FOSS 라이선스에서 요구하는대로 고지를 준비합니다.

source: Notices may include attribution notices, modification notices, or offers for source code.
ko: 고지에는 저작자 고지, 수정 고지, 또는 소스 코드에 대한 약정이 포함될 수 있습니다.

source: Notices, such as text in comments in file headers, often provide authorship and licensing information.
ko: 파일 헤더 안의 커멘트 문구같은 고지는 종종 저작자와 라이선싱 정보를 제공한다.

source: Obligations met
ko: 의무 충족

source: Obligations to provide accompanying source code are met
ko: 동반 소스 코드를 제공해야 할 의무가 충족된다.

source: Offering training to engineering staff about compliance issues, the different types of FOSS licenses and the implications of including FOSS in proprietary source code
ko: 엔지니어링 직원에게 컴플라이언스 이슈, 다양한 유형의 FOSS 라이선스 및 FOSS를 독점 소스 코드에 포함시키는 의미에 대해 교육한다.

source: Offering training to engineering staff
ko: 엔지니어링 직원에게 교육을 제공한다.

source: Offering training to engineering staff on the company's FOSS policies and processes
ko: 회사의 FOSS 정책 및 프로세스에 대해 엔지니어링 직원에게 교육을 제공한다.

source: Offering training to engineering staff to avoid linking software components with licenses that conflict with you FOSS policies which will take a position on these legal risks
ko: 엔지니어링 직원들이 소프트웨어 컴포넌트를 FOSS정책과 충돌하는 라이선스와 링킹하여 이러한 법적 위험에 직면하지 않도록 교육을 제공한다.

source: Offering training to engineering staff to ensure they update copyright markings or license information of all FOSS or proprietary software that is going to be released to the public
ko: 엔지니어링 직원에게 대중에게 공개될 모든 FOSS 또는 독점 소프트웨어의 저작권 표시 또는 라이선스 정보가 업데이트 되는 것을 보장하기 위해 교육을 제공한다.

source: Often the public domain declaration is accompanied by other terms, such as warranty disclaimers; in such cases, the software may be viewed as being under a license rather than being in the public domain
ko: 대개 퍼블릭 도메인 선언은 보증 면제 같은 다른 조건을 수반하는데, 그 경우 소프트웨어는 퍼블릭 도메인에 있지 않고 라이선스의 적용을 받는 것으로 볼 수 있다.

source: Once a FOSS component has been approved for usage in a product, it should be added to the software inventory for that product
ko: 제품 사용에 대한 FOSS 컴포넌트가 승인되면 해당 제품의 소프트웨어 목록에 추가해야한다.

source: Once an audit report is produced that confirms the origin and licensing of source code, the review team should flag and review any issues under the company FOSS policy.
ko: 소스 코드의 출처와 라이선스를 확인하는 검사 보고서가 작성되면, 리뷰팀은 회사 FOSS 정책에 따라 문제가 되는 것을 표시하고 리뷰해야 합니다.

source: Once the proposed FOSS usage has been fully assessed, the legal team will then have the necessary information on which to make its judgments.
ko: 제안된 FOSS 사용이 완전히 평가되면, 법무팀은 판단을 내리는데 필요한 정보를 갖게되는 것입니다.

source: One popular set of licenses are those approved by the FOSS Initiative (OSI) based on their FOSS Definition (OSD).
ko: 널리 쓰이는 라이선스 집합은 FOSS 정의 (OSD)를 기반으로 FOSS Initiative (OSI)에서 승인한 라이선스 집합이다.

source: One popular set of licenses are those approved by the Open Source Initiative (OSI) based on their Open Source Definition (OSD).
ko: 널리 쓰이는 라이선스 집합은 Open Source Initiative (OSI)에서 Open Source Definition(OSD)을 기반으로 승인한 라이선스 집합이다.

source: Ongoing Compliance Tasks:
ko: 지속적인 컴플라이언스 과제:

source: Optimizing
ko: 최적화 (Optimizing)

source: Organizations that have been successful at FOSS compliance have created their own FOSS Compliance Programs (consisting of policies, processes, training and tools) to:
ko: FOSS 컴플라이언스를 성공적으로 갖춘 조직들은 다음 목적을 위하여 자신들만의 FOSS 컴플라이언스 프로그램 (정책, 절차, 교육과 툴로 구성됨)을 구축해 왔다:

source: Other Non-FOSS Licensing Situations
ko: 기타 비 FOSS 라이선스 상황

source: Other examples: MIT, Apache-2.0
ko: 다른 예: MIT, Apache-2.0

source: Other names being used include "hereditary", "copyleft", "share-alike", and pejoratively"viral."
ko: 사용되는 다른 이름에는 "유전 (hereditary)", "Copyleft", "share-alike" 및 경멸하지만, "바이러스성 (viral)"이 포함됩니다.

source: Other parties who want to use the technology may seek a patent license (which may grant rights to use, make, have made, sell, offer for sale, and import the technology)
ko: 그 기술을 사용하고자 하는 다른 당사자는 특허 라이선스(기술을 사용, 제작, 매도, 매도 청약 및 수입할 권한을 부여)를 요청할 수 있다.

source: Other specialists or representatives that may be impacted by FOSS-related issues, such as commercial licensing, compliance or business planning teams.
ko: FOSS 관련 문제의 영향을 받을 수있는 다른 전문가 또는 대표자 (예 : 상용 라이선스, 컴플라이언스 또는 사업 계획팀).

source: Other terms.
ko: 기타 조건.

source: Others may require all the software described in the slide.
ko: 다른 라이선스는 슬라이드에 설명된 모든 소프트웨어를 요구할 수 있습니다.

source: Outcome:
ko: 결과:

source: Outgoing Software
ko: 유출 소프트웨어

source: Outgoing:
ko: 유출:

source: Oversight for FOSS Compliance Program, creation of policy, and compliance decisions
ko: FOSS 컴플라이언스 프로그램을 위한 감독, 정책수립과 컴플라이언스 결정

source: Own Proprietary Software
ko: 자체 독점 소프트웨어

source: Package name
ko: 패키지 이름

source: Packaging
ko: 패키징

source: Pairing
ko: 페어링

source: Pasting
ko: 붙여넣기 (Pasting)

source: Patent Concepts in Software
ko: 소프트웨어의 특허 개념

source: Patent holder can exclude others from practicing the patent, regardless of whether the others have independently created the product.
ko: 특허 소유자는 다른 사람들이 제품을 독자적으로 제작했는지 여부에 관계없이 다른 사람들이 특허를 행사하지 못하게 할 수 있습니다.

source: Patent protects method of operation, such as computer program.
ko: 특허는 컴퓨터 프로그램과 같은 운영 방법을 보호합니다.

source: Patents protect functionality – this can include a method of operation, such as a computer program
ko: 특허는 기능을 보호한다. – 컴퓨터 프로그램과 같은 작동 방법을 포함 할 수 있다.

source: Patents: useful inventions that are novel and non-obvious
ko: 특허: 새롭고 뻔하지 않은 유용한 발명품

source: Performing FOSS review and identifying license obligations
ko: FOSS 검토 이행과 라이선스 의무 식별

source: Performing Reviews
ko: 리뷰 수행

source: Performing reviews
ko: 리뷰 수행

source: Performing reviews - Assess and determine obligations for FOSS usage.
ko: 리뷰 수행 - FOSS 사용에 대한 의무를 평가하고 결정합니다.

source: Permissive FOSS Licenses
ko: Permissive FOSS 라이선스

source: Permissive FOSS license: a term used often to describe minimally restrictive FOSS licenses
ko: Permissive FOSS 라이선스: 제한이 최소한인 FOSS 라이선스를 설명하기 위해 자주 사용되는 용어

source: Perpetual or time limited duration
ko: 영구적 또는 제한적 존속 기간

source: Pitfalls can occur under the following categories: IP failure, license compliance failure, and compliance process failure.
ko: 함정은 다음과 같은 카테고리에서 발생할 수 있습니다: IP 실패, 라이선스 컴플라이언스 실패 및 컴플라이언스 프로세스 실패

source: Please note that each chapter has “Check Your Understanding” slides with questions and answers in the slide notes.
ko: 각 장에는 슬라이드 노트에 질문과 답변으로 구성된 "이해도 확인" 슬라이드가 있습니다.

source: Possible previous approvals in another context
ko: 다른 상황에서 있었던 이전의 승인

source: Post publication verifications
ko: 공개 후 확인

source: Post publication
ko: 공개 후 확인

source: Pre-Distribution Verifications
ko: 배포 전 검증

source: Pre-distribution verifications
ko: 배포 전 검증

source: Pre-distribution verifications – Review distributions for compliance before release.
ko: 배포 전 확인 - 출시 전에 컴플라이언스를 위한 배포를 리뷰합니다.

source: Pre-loaded onto hardware
ko: 하드웨어에 사전 탑재됨

source: Prepare appropriate notices for any FOSS used in a product release:
ko: 제품 출시에 사용되는 FOSS에 대한 적절한 고지를 준비하시오.

source: Prepare business processes and sufficient staff to handle:
ko: 다음 사항을 처리할 비즈니스 절차와 충분한 관리직원을 준비:

source: Preserve audit report findings and mark resolved issues as ready for the next step (i.e. Approval)
ko: 검사 보고서 발견사항을 보존하고, 해결된 이슈에 대해서는 다음 단계(승인)를 위해 준비된 것으로 표시한다.

source: Preserve existing licensing information
ko: 기존 라이선스 정보를 보존한다.

source: Preventative measures include monitoring of engineering training, and also making the compliance process easily accessible to the engineering team.
ko: 예방 조치에는 엔지니어링 직원 교육 모니터링과 엔지니어링 팀이 컴플라이언스 프로세스에 쉽게 접근할 수 있도록 하는 것이 포함됩니다.

source: Preventative measures include training of engineering staff and building regular audits into the development process.
ko: 예방 조치에는 엔지니어링 직원 교육 및 개발 프로세스 내에 정기적인 검사 추가가 포함됩니다.

source: Preventative measures include training of engineering staff, and building architectural reviews into the development process.
ko: 예방 조치에는 엔지니어링 직원 교육 및 개발 프로세스 내에 아키텍쳐 검토 추가가 포함됩니다.

source: Preventative measures include training of engineering staff, and building regular audits or scans into the development process.
ko: 예방 조치에는 엔지니어링 직원 교육 및 개발 프로세스 내에 정기적인 검사 또는 스캔 추가가 포함됩니다.

source: Prevention
ko: 예방

source: Prioritizing compliance promotes:
ko: 컴플라이언스에 우선순위를 부여함으로 다음이 촉진된다 :

source: Product Manager
ko: 제품 관리자

source: Program Manager
ko: 프로그램 관리자

source: Proprietary
ko: 독점

source: Proprietary License or Closed Source
ko: 독점 라이선스 또는 비공개 소스

source: Proprietary licenses are unique to each vendor – there are as many variations of proprietary licenses as there are vendors and each must be evaluated individually
ko: 독점 라이선스는 각 공급 업체마다 고유함 – 공급 업체 수 만큼 다양한 독점 라이선스가 존재하며 각각은 개별적으로 평가되어야한다.

source: Protects expression (not the underlying idea)
ko: 표현(바탕에 깔린 아이디어가 아님)을 보호

source: Provide accompanying source code along with any associated build tools and documentation (e.g., by uploading to a distribution website or including in the distribution package)
ko: 동반 소스 코드를 관련 빌드 도구 및 문서와 함께 제공한다. (예: 배포 사이트에 업로드하거나 배포 패키지에 포함).

source: Provide accompanying source code as required
ko: 요구되는 동반소스 코드를 제공한다.

source: Provide feedback to the appropriate engineers to resolve issues in the audit report that conflict with your FOSS policy
ko: FOSS 정책과 충돌하는 검사 보고서 내의 문제를 해결하기 위해 적절한 엔지니어에게 피드백을 제공하시오.

source: Provide guidance compatible with company policy and business objectives
ko: 회사 정책 및 비즈니스 목표와 양립 가능한 가이드 제공

source: Providing accompanying source code
ko: 해당 소스 코드 제공

source: Providing notice of modification
ko: 수정 고지 제공

source: Providing proper staffing as to not fall behind in schedule
ko: 일정이 지연되지 않도록 적절한 인력 제공

source: Providing the Incorrect Version of Accompanying Source Code
ko: 동반하는 소스 코드의 잘못된 버전 제공

source: Public Domain
ko: 퍼블릭 도메인

source: Publish source code,
ko: 소스 코드 공개,고지 및 서면 청약 제공

source: Publish source code, notices and provide written offer
ko: 소스 코드 공개,고지 및 서면 청약 제공

source: Queued for Process
ko: 프로세스 대기중

source: Reciprocity.
ko: 상호성.

source: Record approved
ko: 각 제품 및 출시별 승인된 소프트웨어/버전을 목록에 기록

source: Record approved software/version in inventory per product and per release
ko: 각 제품 및 출시별 승인된 소프트웨어/버전을 목록에 기록

source: Reduction and management of infringement risk, increased respect of FOSS developers/owners’ licensing choices
ko: 위반 위험의 감소와 관리, FOSS개발자/소유자의 라이선싱 선택에 대한 존중 증가

source: Registration
ko: 등록

source: Registration / Approval Tracking
ko: 등록 / 승인 추적

source: Registration/approval tracking
ko: 추적 등록 / 승인

source: Registration/approval tracking – Track approval conditions and license obligations for later compliance steps.
ko: 등록/승인 추적 - 추후 컴플라이언스 단계를 위해 승인 조건 및 라이선스 의무를 추적합니다.

source: Released under CC0-1.0. You may use, modify, and share these slides without restriction. They also come with no warranty.
ko: CC0-1.0에 따라 제공됨 제한없이 이 슬라이드를 사용, 수정 및 공유할 수 있음. 보증 없이 제공됨.

source: Relevant terms include:
ko: 관련 용어는 다음을 포함한다:

source: Reproduce the entire text of the license agreements for the FOSS code included in the product as needed
ko: 필요에 따라 제품에 포함된 FOSS 코드에 대한 라이선스 계약의 전체 텍스트를 복제한다.

source: Request formal approval for each FOSS component you are using
ko: 사용 중인 각 FOSS 컴포넌트에 대한 공식적인 승인을 신청한다.

source: Request formal approval for outside contributions to FOSS projects
ko: FOSS 프로젝트로의 외부 기여에 대해 공식 승인을 신청한다.

source: Resolve Issues
ko: 문제 해결

source: Resolve all issues identified in the audit
ko: 검사에서 확인된 모든 문제를 해결하시오

source: Resolve any
ko: 회사 FOSS 정책에 따라 모든 검사 문제 해결

source: Resolve any audit issues in line with company FOSS policies
ko: 회사 FOSS 정책에 따라 모든 검사 문제 해결

source: Resolving Issues
ko: 문제 해결

source: Resolving issues
ko: 문제 해결

source: Resolving issues - Remove FOSS usage that is incompatible with FOSS policies.
ko: 문제 해결 - FOSS 정책과 호환되지 않는 FOSS 사용을 제거합니다.

source: Respect FOSS developer/owner rights and comply with license obligations
ko: FOSS 개발자/소유자의 권리를 존중하고 라이선스상 의무를 준수하고

source: Review and Approve all FOSS components used
ko: 사용된 모든 FOSS 컴포넌트 리뷰 및 승인.

source: Review and approve
ko: FOSS 컴포넌트의 컴플라이언스 기록 리뷰 및 승인

source: Review and approve any outbound contributions to FOSS projects
ko: FOSS 프로젝트에 대한 외부로의 기여에 대해 리뷰 및 승인.

source: Review and approve compliance record of FOSS software components
ko: FOSS 컴포넌트의 컴플라이언스 기록 리뷰 및 승인

source: Review architecture plans and avoid mixing components governed by incompatible FOSS licenses
ko: 아키텍처 계획을 리뷰하여 양립가능하지 않는 FOSS 라이선스가 적용되는 컴포넌트들을 결합시키는 것을 방지한다.

source: Review the resolved issues to confirm it matches your FOSS policy
ko: 해결된 문제를 리뷰하여 FOSS 정책과 일치하는지 확인한다.

source: Reviews
ko: 리뷰

source: Running a FOSS Review
ko: FOSS 검토 실행

source: Satisfy license obligations.
ko: 라이선스 의무 충족.

source: Scan or audit source code
ko: 스캔 또는 소스 코드 검사

source: Scanning
ko: 스캐닝

source: Scanning and tooling teams that identify and track FOSS usage.
ko: FOSS 사용을 식별하고 추적하는 스캐닝 및 도구 운영 팀.

source: Scans of the software
ko: 소프트웨어 스캔

source: Seek guidance
ko: 가이드를 요구한다.

source: Select code from high quality, well supported FOSS communities
ko: 고품질이면서 FOSS 커뮤니티 지원이 잘 되는 코드를 선택한다.

source: Shareware – proprietary software provided to users on a trial basis, for a limited time, free of charge and with limited functionalities or features
ko: 쉐어웨어 – 제한된 시간 동안 제한된 기능을 사용자에게 시범적으로 무료 제공하는 독점 소프트웨어

source: Should you remove or alter FOSS license header information?
ko: FOSS 라이선스 헤더 정보를 삭제하거나 변경해야 하는가?

source: Small companies may use a simple checklist and enterprises a detailed process.
ko: 소규모 회사는 간단한 체크리스트를, 큰 기업들은 상세한 절차를 사용할 수 있다.

source: Smaller companies may wish to approach the process in a more streamlined way.
ko: 소규모 기업은 보다 간소화된 방식으로 프로세스에 접근하고자 할 수 있습니다.

source: Software can be subject to a patent.
ko: 소프트웨어는 특허의 대상이 될 수 있습니다.

source: Software is protected by copyright
ko: 소프트웨어는 저작권의 보호를 받는다.

source: Some FOSS licenses are compatible with each other.
ko: 일부 FOSS 라이선스는 서로 양립 가능합니다.

source: Some are incompatible.
ko: 일부는 양립 불가능합니다.

source: Some licenses define the trigger event to include permitting access to software running on a server (e.g., all versions of the Affero GPL if the software is modified) or in the case of “users interacting with it remotely through a computer network”
ko: 어떤 라이선스들은 “의무발생”사유를 서버에서 작동하는 소프트웨어에 접근 허용하는 것이나(예, 소프트웨어가 수정되는 경우 모든 Affero GPL버전) “컴퓨터 네트워크를 통해 원격으로 소프트웨어와 상호작용하는 사용자들”의 경우를 포함하는 것으로 정의한다.

source: Some licenses may require source code availability for only the FOSS software.
ko: 일부 라이선스는 단지 FOSS 소프트웨어에 대해서만 소스 코드 입수 가능성을 요구합니다.

source: Some licenses require that FOSS Notices be retained or reproduced for attribution purposes.
ko: 일부 라이선스는 저작자 고지 목적으로 FOSS 고지 사항을 유지하거나 복제할 것을 요구합니다.

source: Some licenses require that if derivative works (or software in the same file, same program or other boundary) are distributed, the distribution is under the same terms as the original work
ko: 일부 라이선스는 파생 저작물(또는 동일 파일, 동일 프로그램 또는 다른 영역의 소프트웨어)이 배포되는 경우 원본 저작물과 동일한 조건으로 배포 할 것을 요구한다.

source: Sometimes a FOSS usage scenario may not be clear to the FOSS review team.
ko: 때로는 FOSS 사용 시나리오가 FOSS 리뷰팀에게 명확하지 않을 수도 있습니다.

source: Sometimes a project has a disjunctive licensing situation, but only one license is included in your code – so perhaps the person you got the code from already made this choice.
ko: 때때로 프로젝트가 선택형 라이선싱 상황이지만, 귀하의 코드에 하나의 라이선스만 포함되어 있는 경우도 있습니다. - 아마도 당신이 얻은 코드를 제공한 사람이 이미 이 선택을 하였을 것입니다.

source: Sometimes these are confused with FOSS but their requirements are actually different.
ko: 때때로 이들은 FOSS와 혼동되지만 요구 사항은 실제로 다릅니다.

source: Source Code Scanning Tools
ko: 소스 코드 스캐닝 도구

source: Source code availability.
ko: 소스 코드 입수 가능성.

source: Source code delivery
ko: 소스 코드 제공

source: Source code for the audit is identified
ko: 검사할 소스 코드가 식별됨.

source: Source code scanning and tooling support to help identify and track FOSS usage
ko: FOSS 사용을 식별하고 추적할 수 있는 소스 코드 스캐닝 및 도구 지원

source: Source may be scanned by a software tool
ko: 소스는 소프트웨어 도구로 스캔할 수도 있음.

source: Specialists
ko: 전문가

source: Static/Dynamic Linking
ko: 정적/동적 링킹

source: Status of the community around the package (activity, diverse membership, responsiveness)
ko: 패키지를 제공하는 커뮤니티의 상태 (활동, 다양한 회원, 반응도)

source: Steps:
ko: 단계:

source: Such actions often include:
ko: 이러한 활동에는 주로 다음이 포함된다.:
